In [5]:
#import packages
import numpy as np
import pandas as pd

In [60]:
#load data
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

#top rows
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put inplace. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [ ]:
df['FlightNumber'].fillna()

In [42]:
#.to_numeric
df['FlightNumber']=pd.to_numeric(df['FlightNumber'], downcast='integer')

#Astype convert  with example
#df['FlightNumber'].astype(float)

2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [61]:
# split the column based on separator and expand (expand dimensions)
df_split=df['From_To'].str.split("_",n=1,expand=True)
df_split.head()

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [62]:
#assign new column to df from splitted dataframe df_split based on inxde like below 
df['From']=df_split[0]
df['To']=df_split[1]

In [63]:
#remove  columns from 
df.drop(columns='From_To',inplace=True)
df.head()

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1           NaN            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3           NaN          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [64]:
df['From']=df['From'].str.upper()
df['From']

0      LONDON
1      MADRID
2      LONDON
3    BUDAPEST
4    BRUSSELS
Name: From, dtype: object

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   FlightNumber  3 non-null      float64
 1   RecentDelays  5 non-null      object
 2   Airline       5 non-null      object
 3   From          5 non-null      object
 4   To            5 non-null      object
dtypes: float64(1), object(4)
memory usage: 328.0+ bytes

In [73]:
df['RecentDelays']=df['RecentDelays'].replace( ["[","]"],[""],column="RecentDelays",inplace=True)

TypeError: replace() got an unexpected keyword argument 'column'

In [70]:
df['RecentDelays']

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object